{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm0", 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu0", 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm1", 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 1], [16, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu1", 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling0", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "avg", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm2", 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0], [25, 0, 1], [26, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu2", 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution3_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm3", 
      "inputs": [[31, 0, 0], [32, 0, 0], [33, 0, 0], [34, 0, 1], [35, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu3", 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling1", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "avg", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution4_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution4_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution4", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[38, 0, 0], [39, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm4", 
      "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0], [44, 0, 1], [45, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu4", 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution5_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution5_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution5", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[47, 0, 0], [48, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm5", 
      "inputs": [[50, 0, 0], [51, 0, 0], [52, 0, 0], [53, 0, 1], [54, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu5", 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution6_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution6_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution6", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm6", 
      "inputs": [[59, 0, 0], [60, 0, 0], [61, 0, 0], [62, 0, 1], [63, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu6", 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling2", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "avg", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution7_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution7_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution7", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[66, 0, 0], [67, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm7", 
      "inputs": [[69, 0, 0], [70, 0, 0], [71, 0, 0], [72, 0, 1], [73, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu7", 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution8_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution8_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution8", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[75, 0, 0], [76, 0, 0], [77, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm8", 
      "inputs": [[78, 0, 0], [79, 0, 0], [80, 0, 0], [81, 0, 1], [82, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu8", 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose0", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice0", 
      "attrs": {
        "begin": "(None, 0, None, None)", 
        "end": "(None, 1, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0", 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "f_weight", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected0", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[87, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[89, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice1", 
      "attrs": {
        "begin": "(None, 1, None, None)", 
        "end": "(None, 2, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten1", 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected1", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[92, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims1", 
      "attrs": {"axis": "1"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice2", 
      "attrs": {
        "begin": "(None, 2, None, None)", 
        "end": "(None, 3, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten2", 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected2", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[96, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims2", 
      "attrs": {"axis": "1"}, 
      "inputs": [[97, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice3", 
      "attrs": {
        "begin": "(None, 3, None, None)", 
        "end": "(None, 4, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten3", 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected3", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[100, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims3", 
      "attrs": {"axis": "1"}, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice4", 
      "attrs": {
        "begin": "(None, 4, None, None)", 
        "end": "(None, 5, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten4", 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected4", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[104, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims4", 
      "attrs": {"axis": "1"}, 
      "inputs": [[105, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice5", 
      "attrs": {
        "begin": "(None, 5, None, None)", 
        "end": "(None, 6, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten5", 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected5", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[108, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims5", 
      "attrs": {"axis": "1"}, 
      "inputs": [[109, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice6", 
      "attrs": {
        "begin": "(None, 6, None, None)", 
        "end": "(None, 7, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten6", 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected6", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[112, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims6", 
      "attrs": {"axis": "1"}, 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice7", 
      "attrs": {
        "begin": "(None, 7, None, None)", 
        "end": "(None, 8, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten7", 
      "inputs": [[115, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected7", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[116, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims7", 
      "attrs": {"axis": "1"}, 
      "inputs": [[117, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice8", 
      "attrs": {
        "begin": "(None, 8, None, None)", 
        "end": "(None, 9, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten8", 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected8", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[120, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims8", 
      "attrs": {"axis": "1"}, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice9", 
      "attrs": {
        "begin": "(None, 9, None, None)", 
        "end": "(None, 10, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten9", 
      "inputs": [[123, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected9", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[124, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims9", 
      "attrs": {"axis": "1"}, 
      "inputs": [[125, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice10", 
      "attrs": {
        "begin": "(None, 10, None, None)", 
        "end": "(None, 11, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten10", 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected10", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[128, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims10", 
      "attrs": {"axis": "1"}, 
      "inputs": [[129, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice11", 
      "attrs": {
        "begin": "(None, 11, None, None)", 
        "end": "(None, 12, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten11", 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected11", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[132, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims11", 
      "attrs": {"axis": "1"}, 
      "inputs": [[133, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice12", 
      "attrs": {
        "begin": "(None, 12, None, None)", 
        "end": "(None, 13, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten12", 
      "inputs": [[135, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected12", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[136, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims12", 
      "attrs": {"axis": "1"}, 
      "inputs": [[137, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice13", 
      "attrs": {
        "begin": "(None, 13, None, None)", 
        "end": "(None, 14, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten13", 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected13", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[140, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims13", 
      "attrs": {"axis": "1"}, 
      "inputs": [[141, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice14", 
      "attrs": {
        "begin": "(None, 14, None, None)", 
        "end": "(None, 15, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten14", 
      "inputs": [[143, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected14", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[144, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims14", 
      "attrs": {"axis": "1"}, 
      "inputs": [[145, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice15", 
      "attrs": {
        "begin": "(None, 15, None, None)", 
        "end": "(None, 16, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten15", 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected15", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[148, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims15", 
      "attrs": {"axis": "1"}, 
      "inputs": [[149, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice16", 
      "attrs": {
        "begin": "(None, 16, None, None)", 
        "end": "(None, 17, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten16", 
      "inputs": [[151, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected16", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[152, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims16", 
      "attrs": {"axis": "1"}, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice17", 
      "attrs": {
        "begin": "(None, 17, None, None)", 
        "end": "(None, 18, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten17", 
      "inputs": [[155, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected17", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[156, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims17", 
      "attrs": {"axis": "1"}, 
      "inputs": [[157, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice18", 
      "attrs": {
        "begin": "(None, 18, None, None)", 
        "end": "(None, 19, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten18", 
      "inputs": [[159, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected18", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[160, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims18", 
      "attrs": {"axis": "1"}, 
      "inputs": [[161, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice19", 
      "attrs": {
        "begin": "(None, 19, None, None)", 
        "end": "(None, 20, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten19", 
      "inputs": [[163, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected19", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[164, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims19", 
      "attrs": {"axis": "1"}, 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice20", 
      "attrs": {
        "begin": "(None, 20, None, None)", 
        "end": "(None, 21, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten20", 
      "inputs": [[167, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected20", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[168, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims20", 
      "attrs": {"axis": "1"}, 
      "inputs": [[169, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice21", 
      "attrs": {
        "begin": "(None, 21, None, None)", 
        "end": "(None, 22, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten21", 
      "inputs": [[171, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected21", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[172, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims21", 
      "attrs": {"axis": "1"}, 
      "inputs": [[173, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice22", 
      "attrs": {
        "begin": "(None, 22, None, None)", 
        "end": "(None, 23, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten22", 
      "inputs": [[175, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected22", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[176, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims22", 
      "attrs": {"axis": "1"}, 
      "inputs": [[177, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice23", 
      "attrs": {
        "begin": "(None, 23, None, None)", 
        "end": "(None, 24, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten23", 
      "inputs": [[179, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected23", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[180, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims23", 
      "attrs": {"axis": "1"}, 
      "inputs": [[181, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice24", 
      "attrs": {
        "begin": "(None, 24, None, None)", 
        "end": "(None, 25, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten24", 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected24", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[184, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims24", 
      "attrs": {"axis": "1"}, 
      "inputs": [[185, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice25", 
      "attrs": {
        "begin": "(None, 25, None, None)", 
        "end": "(None, 26, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten25", 
      "inputs": [[187, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected25", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[188, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims25", 
      "attrs": {"axis": "1"}, 
      "inputs": [[189, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice26", 
      "attrs": {
        "begin": "(None, 26, None, None)", 
        "end": "(None, 27, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten26", 
      "inputs": [[191, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected26", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[192, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims26", 
      "attrs": {"axis": "1"}, 
      "inputs": [[193, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice27", 
      "attrs": {
        "begin": "(None, 27, None, None)", 
        "end": "(None, 28, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten27", 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected27", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[196, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims27", 
      "attrs": {"axis": "1"}, 
      "inputs": [[197, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice28", 
      "attrs": {
        "begin": "(None, 28, None, None)", 
        "end": "(None, 29, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten28", 
      "inputs": [[199, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected28", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[200, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims28", 
      "attrs": {"axis": "1"}, 
      "inputs": [[201, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice29", 
      "attrs": {
        "begin": "(None, 29, None, None)", 
        "end": "(None, 30, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten29", 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected29", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[204, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims29", 
      "attrs": {"axis": "1"}, 
      "inputs": [[205, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice30", 
      "attrs": {
        "begin": "(None, 30, None, None)", 
        "end": "(None, 31, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten30", 
      "inputs": [[207, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected30", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[208, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims30", 
      "attrs": {"axis": "1"}, 
      "inputs": [[209, 0, 0]]
    }, 
    {
      "op": "slice", 
      "name": "slice31", 
      "attrs": {
        "begin": "(None, 31, None, None)", 
        "end": "(None, 32, None, None)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten31", 
      "inputs": [[211, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected31", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[212, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims31", 
      "attrs": {"axis": "1"}, 
      "inputs": [[213, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attrs": {"num_args": "32"}, 
      "inputs": [
        [90, 0, 0], 
        [94, 0, 0], 
        [98, 0, 0], 
        [102, 0, 0], 
        [106, 0, 0], 
        [110, 0, 0], 
        [114, 0, 0], 
        [118, 0, 0], 
        [122, 0, 0], 
        [126, 0, 0], 
        [130, 0, 0], 
        [134, 0, 0], 
        [138, 0, 0], 
        [142, 0, 0], 
        [146, 0, 0], 
        [150, 0, 0], 
        [154, 0, 0], 
        [158, 0, 0], 
        [162, 0, 0], 
        [166, 0, 0], 
        [170, 0, 0], 
        [174, 0, 0], 
        [178, 0, 0], 
        [182, 0, 0], 
        [186, 0, 0], 
        [190, 0, 0], 
        [194, 0, 0], 
        [198, 0, 0], 
        [202, 0, 0], 
        [206, 0, 0], 
        [210, 0, 0], 
        [214, 0, 0]
      ]
    }, 
    {
      "op": "transpose", 
      "name": "transpose1", 
      "attrs": {"axes": "(1, 0, 2)"}, 
      "inputs": [[215, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label", 
      "inputs": []
    }, 
    {
      "op": "_contrib_CTCLoss", 
      "name": "ctc_loss0", 
      "inputs": [[216, 0, 0], [217, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "makeloss0", 
      "inputs": [[218, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    5, 
    6, 
    7, 
    10, 
    11, 
    13, 
    14, 
    15, 
    16, 
    20, 
    21, 
    23, 
    24, 
    25, 
    26, 
    29, 
    30, 
    32, 
    33, 
    34, 
    35, 
    39, 
    40, 
    42, 
    43, 
    44, 
    45, 
    48, 
    49, 
    51, 
    52, 
    53, 
    54, 
    57, 
    58, 
    60, 
    61, 
    62, 
    63, 
    67, 
    68, 
    70, 
    71, 
    72, 
    73, 
    76, 
    77, 
    79, 
    80, 
    81, 
    82, 
    88, 
    217
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122, 
    123, 
    124, 
    125, 
    126, 
    127, 
    128, 
    129, 
    130, 
    131, 
    132, 
    133, 
    134, 
    135, 
    136, 
    137, 
    138, 
    139, 
    140, 
    141, 
    142, 
    143, 
    144, 
    145, 
    146, 
    147, 
    148, 
    149, 
    150, 
    151, 
    152, 
    153, 
    154, 
    155, 
    156, 
    157, 
    158, 
    159, 
    160, 
    161, 
    162, 
    163, 
    164, 
    165, 
    166, 
    167, 
    168, 
    169, 
    170, 
    171, 
    172, 
    173, 
    174, 
    175, 
    176, 
    177, 
    178, 
    179, 
    180, 
    181, 
    182, 
    183, 
    184, 
    185, 
    186, 
    187, 
    188, 
    189, 
    190, 
    191, 
    192, 
    193, 
    194, 
    195, 
    196, 
    197, 
    198, 
    199, 
    200, 
    201, 
    202, 
    203, 
    204, 
    205, 
    206, 
    207, 
    208, 
    209, 
    210, 
    211, 
    212, 
    213, 
    214, 
    215, 
    216, 
    217, 
    218, 
    219, 
    220, 
    221, 
    222, 
    223, 
    224, 
    225, 
    226, 
    227, 
    228, 
    229, 
    230, 
    231, 
    232, 
    233, 
    234, 
    235, 
    236, 
    238, 
    239
  ], 
  "heads": [[219, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10200]}
}